espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/usb/src/sl_usbd_class_vendor.c
/***************************************************************************//**
 * @file
 * @brief USB Device Vendor Class
 *******************************************************************************
 * # License
 * <b>Copyright 2018 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * The licensor of this software is Silicon Laboratories Inc.  Your use of this
 * software is governed by the terms of Silicon Labs Master Software License
 * Agreement (MSLA) available at
 * www.silabs.com/about-us/legal/master-software-license-agreement.
 * The software is governed by the sections of the MSLA applicable to Micrium
 * Software.
 *
 ******************************************************************************/

/********************************************************************************************************
 ********************************************************************************************************
 *                                               INCLUDE FILES
 ********************************************************************************************************
 *******************************************************************************************************/

#include <string.h>
#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>

#include "sl_bit.h"
#include "sl_enum.h"
#include "sl_status.h"

#include "em_core.h"

#include "sl_usbd_core.h"
#include "sl_usbd_class_vendor.h"

#include "sli_usbd_core.h"

/********************************************************************************************************
 ********************************************************************************************************
 *                                               LOCAL DEFINES
 ********************************************************************************************************
 *******************************************************************************************************/

/********************************************************************************************************
 ********************************************************************************************************
 *                                           LOCAL DATA TYPES
 ********************************************************************************************************
 *******************************************************************************************************/

/********************************************************************************************************
 *                                           FORWARD DECLARATIONS
 *******************************************************************************************************/

typedef struct sli_usbd_vendor_ctrl sli_usbd_vendor_ctrl_t;

/********************************************************************************************************
 *                                           VENDOR CLASS STATES
 *******************************************************************************************************/

SL_ENUM(sli_usbd_vendor_state_t) {
  SLI_USBD_VENDOR_STATE_NONE = 0,
  SLI_USBD_VENDOR_STATE_INIT,
  SLI_USBD_VENDOR_STATE_CONFIG
};

/********************************************************************************************************
 *                               VENDOR CLASS EP REQUIREMENTS DATA TYPE
 *******************************************************************************************************/

// Vendor class comm info
typedef struct {
  // Ptr to ctrl info.
  sli_usbd_vendor_ctrl_t *ctrl_ptr;
  // Avail EP for comm: Bulk (and Intr)
  uint8_t       data_bulk_in_endpoint_address;
  uint8_t       data_bulk_out_endpoint_address;
  uint8_t       interrupt_in_endpoint_address;
  uint8_t       interrupt_out_endpoint_address;

  bool      data_bulk_in_active_transfer;
  bool      data_bulk_out_active_transfer;
  bool      interrupt_in_active_transfer;
  bool      interrupt_out_active_transfer;
} sli_usbd_vendor_comm_t;

// Vendor Class Ctrl Info
struct sli_usbd_vendor_ctrl {
  sli_usbd_vendor_state_t           state;                                ///< Vendor class state.
  uint8_t                           class_nbr;                            ///< Vendor class instance nbr.
  sli_usbd_vendor_comm_t            *comm_ptr;                            ///< Vendor class comm info ptr.
  bool                              interrupt_enable;                     ///< Intr IN & OUT EPs en/dis flag.
  uint16_t                          interrupt_interval;                   ///< Polling interval for intr IN & OUT EPs.
  sl_usbd_vendor_callbacks_t        *callback_ptr;                        ///< Ptr to app callback for vendor-specific req.
  sl_usbd_vendor_async_function_t   bulk_read_async_function;             ///< Ptr to callback  used for async comm.
  void                              *bulk_read_async_arg_ptr;             ///< Ptr to extra arg used for async comm.
  sl_usbd_vendor_async_function_t   bulk_write_async_function;            ///< Ptr to callback  used for async comm.
  void                              *bulk_write_async_arg_ptr;            ///< Ptr to extra arg used for async comm.
  sl_usbd_vendor_async_function_t   interrupt_read_async_function;        ///< Ptr to callback  used for async comm.
  void                              *interrupt_read_async_arg_ptr;        ///< Ptr to extra arg used for async comm.
  sl_usbd_vendor_async_function_t   interrupt_write_async_function;       ///< Ptr to callback  used for async comm.
  void                              *interrupt_write_async_arg_ptr;       ///< Ptr to extra arg used for async comm.
#if (USBD_CFG_MS_OS_DESC_EN == 1)                                         // Microsoft ext properties.
  sl_usbd_microsoft_ext_property_t  microsoft_ext_property_table[SL_USBD_VENDOR_MS_EXTENDED_PROPERTIES_QUANTITY];
  uint8_t                           interface_number;                     // Interface number associated with class instance
  uint8_t                           microsoft_ext_property_next;
#endif
};

