espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/usb/src/sl_usbd_class_vendor.c
// Vendor Class Root Struct
typedef struct {
  sli_usbd_vendor_ctrl_t  ctrl_table[SL_USBD_VENDOR_CLASS_INSTANCE_QUANTITY];                                        ///< Vendor class ctrl array.
  uint8_t                 ctrl_nbr_next;
  sli_usbd_vendor_comm_t  comm_tbl[SL_USBD_VENDOR_CLASS_INSTANCE_QUANTITY * SL_USBD_VENDOR_CONFIGURATION_QUANTITY];  ///< Vendor class comm array.
  uint8_t                 comm_nbr_next;
} sli_usbd_vendor_t;

/********************************************************************************************************
 ********************************************************************************************************
 *                                           LOCAL CONSTANTS
 ********************************************************************************************************
 *******************************************************************************************************/

/********************************************************************************************************
 ********************************************************************************************************
 *                                       LOCAL GLOBAL VARIABLES
 ********************************************************************************************************
 *******************************************************************************************************/

static sli_usbd_vendor_t usbd_vendor;

/********************************************************************************************************
 ********************************************************************************************************
 *                                       LOCAL FUNCTION PROTOTYPES
 ********************************************************************************************************
 *******************************************************************************************************/

static void usbd_vendor_enable(uint8_t config_nbr,
                               void    *p_if_class_arg);

static void usbd_vendor_disable(uint8_t config_nbr,
                                void    *p_if_class_arg);

static bool usbd_vendor_request_handler(const sl_usbd_setup_req_t *p_setup_req,
                                        void                      *p_if_class_arg);

#if (USBD_CFG_MS_OS_DESC_EN == 1)
static uint8_t usbd_vendor_get_microsoft_compat_id(uint8_t *p_sub_compat_id_ix);

static uint8_t usbd_vendor_get_microsoft_ext_property_table(sl_usbd_microsoft_ext_property_t **pp_ext_property_tbl, uint8_t if_no);
#endif

static void usbd_vendor_read_bulk_async_complete(uint8_t      ep_addr,
                                                 void         *p_buf,
                                                 uint32_t     buf_len,
                                                 uint32_t     xfer_len,
                                                 void         *p_arg,
                                                 sl_status_t  status);

static void usbd_vendor_write_bulk_async_complete(uint8_t      ep_addr,
                                                  void         *p_buf,
                                                  uint32_t     buf_len,
                                                  uint32_t     xfer_len,
                                                  void         *p_arg,
                                                  sl_status_t  status);

static void usbd_vendor_read_interrupt_async_complete(uint8_t      ep_addr,
                                                      void         *p_buf,
                                                      uint32_t     buf_len,
                                                      uint32_t     xfer_len,
                                                      void         *p_arg,
                                                      sl_status_t  status);

static void usbd_vendor_write_interrupt_async_complete(uint8_t      ep_addr,
                                                       void         *p_buf,
                                                       uint32_t     buf_len,
                                                       uint32_t     xfer_len,
                                                       void         *p_arg,
                                                       sl_status_t  status);

/********************************************************************************************************
 *                                           VENDOR CLASS DRIVER
 *******************************************************************************************************/

static sl_usbd_class_driver_t usbd_vendor_driver = {
  usbd_vendor_enable,
  usbd_vendor_disable,
  NULL,                                                     // Vendor does NOT use alternate interface(s).
  NULL,
  NULL,                                                     // Vendor does NOT use functional EP desc.
  NULL,
  NULL,                                                     // Vendor does NOT use functional IF desc.
  NULL,
  NULL,                                                     // Vendor does NOT handle std req with IF recipient.
  NULL,                                                     // Vendor does NOT define class-specific req.
  usbd_vendor_request_handler,

#if (USBD_CFG_MS_OS_DESC_EN == 1)
  usbd_vendor_get_microsoft_compat_id,
  usbd_vendor_get_microsoft_ext_property_table,
#endif
};

/********************************************************************************************************
 ********************************************************************************************************
 *                                           GLOBAL FUNCTIONS
 ********************************************************************************************************
 *******************************************************************************************************/

/****************************************************************************************************//**
 * Initializes the internal structures and variables used by the Vendor class
 *******************************************************************************************************/
sl_status_t sl_usbd_vendor_init(void)
{
  uint8_t       ix;
  sli_usbd_vendor_ctrl_t *p_ctrl;
  sli_usbd_vendor_comm_t *p_comm;

  usbd_vendor.ctrl_nbr_next = SL_USBD_VENDOR_CLASS_INSTANCE_QUANTITY;
  usbd_vendor.comm_nbr_next = SL_USBD_VENDOR_CLASS_INSTANCE_QUANTITY * SL_USBD_VENDOR_CONFIGURATION_QUANTITY;

