espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/usb/src/sl_usbd_class_vendor.c
  // Init vendor class struct.
  for (ix = 0u; ix < usbd_vendor.ctrl_nbr_next; ix++) {
    p_ctrl = &usbd_vendor.ctrl_table[ix];
    p_ctrl->state = SLI_USBD_VENDOR_STATE_NONE;
    p_ctrl->class_nbr = SL_USBD_CLASS_NBR_NONE;
    p_ctrl->comm_ptr = NULL;
    p_ctrl->interrupt_enable = false;
    p_ctrl->interrupt_interval = 0u;
    p_ctrl->callback_ptr = NULL;
    p_ctrl->bulk_read_async_function = NULL;
    p_ctrl->bulk_read_async_arg_ptr = NULL;
    p_ctrl->bulk_write_async_function = NULL;
    p_ctrl->bulk_write_async_arg_ptr = NULL;
    p_ctrl->interrupt_read_async_function = NULL;
    p_ctrl->interrupt_read_async_arg_ptr = NULL;
    p_ctrl->interrupt_write_async_function = NULL;
    p_ctrl->interrupt_write_async_arg_ptr = NULL;

#if (USBD_CFG_MS_OS_DESC_EN == 1)
    p_ctrl->microsoft_ext_property_next = 0u;

    memset(p_ctrl->microsoft_ext_property_table, 0, sizeof(sl_usbd_microsoft_ext_property_t) * SL_USBD_VENDOR_MS_EXTENDED_PROPERTIES_QUANTITY);
#endif
  }

  // Init vendor EP tbl.
  for (ix = 0u; ix < usbd_vendor.comm_nbr_next; ix++) {
    p_comm = &usbd_vendor.comm_tbl[ix];
    p_comm->ctrl_ptr = NULL;
    p_comm->data_bulk_in_endpoint_address = SL_USBD_ENDPOINT_ADDR_NONE;
    p_comm->data_bulk_out_endpoint_address = SL_USBD_ENDPOINT_ADDR_NONE;
    p_comm->interrupt_in_endpoint_address = SL_USBD_ENDPOINT_ADDR_NONE;
    p_comm->interrupt_out_endpoint_address = SL_USBD_ENDPOINT_ADDR_NONE;

    p_comm->data_bulk_in_active_transfer = false;
    p_comm->data_bulk_out_active_transfer = false;
    p_comm->interrupt_in_active_transfer = false;
    p_comm->interrupt_out_active_transfer = false;
  }

  return SL_STATUS_OK;
}

/****************************************************************************************************//**
 * Adds a new instance of the Vendor class
 *******************************************************************************************************/
sl_status_t sl_usbd_vendor_create_instance(bool                        intr_en,
                                           uint16_t                    interval,
                                           sl_usbd_vendor_callbacks_t  *p_vendor_callbacks,
                                           uint8_t                     *p_class_nbr)
{
  sli_usbd_vendor_ctrl_t *p_ctrl;
  uint8_t       vendor_class_nbr;
  CORE_DECLARE_IRQ_STATE;

  if (p_class_nbr == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  if (intr_en == true) {
    // interval must be a power of 2.
    if (SLI_USBD_IS_PWR2(interval) != true) {
      *p_class_nbr = SL_USBD_CLASS_NBR_NONE;
      return SL_STATUS_INVALID_PARAMETER;
    }
  }

  CORE_ENTER_ATOMIC();
  // Chk if max nbr of instances reached.
  if (usbd_vendor.ctrl_nbr_next == 0u) {
    CORE_EXIT_ATOMIC();
    *p_class_nbr = SL_USBD_CLASS_NBR_NONE;
    return SL_STATUS_ALLOCATION_FAILED;
  }

  // Next avail vendor class instance nbr.
  usbd_vendor.ctrl_nbr_next--;
  // Alloc new vendor class instance nbr.
  vendor_class_nbr = usbd_vendor.ctrl_nbr_next;
  CORE_EXIT_ATOMIC();

  p_ctrl = &usbd_vendor.ctrl_table[vendor_class_nbr];          // Get vendor class instance.
                                                               // Store vendor class instance info.
  p_ctrl->interrupt_enable = intr_en;                          // Intr EPs en/dis.
  p_ctrl->interrupt_interval = interval;                       // Polling interval for intr EPs.
  p_ctrl->callback_ptr = p_vendor_callbacks;                   // App callback for vendor-specific req.

  *p_class_nbr = vendor_class_nbr;
  return SL_STATUS_OK;
}

/****************************************************************************************************//**
 * Creates a new instance of the Vendor class
 *******************************************************************************************************/
sl_status_t sl_usbd_vendor_add_to_configuration(uint8_t class_nbr,
                                                uint8_t config_nbr)
{
  sli_usbd_vendor_ctrl_t *p_ctrl;
  sli_usbd_vendor_comm_t *p_comm;
  uint8_t       if_nbr;
  uint8_t       ep_addr;
  uint16_t       comm_nbr;
  uint16_t       intr_interval;
  sl_status_t        status;
  CORE_DECLARE_IRQ_STATE;

  if (class_nbr >= SL_USBD_VENDOR_CLASS_INSTANCE_QUANTITY) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  // Get vendor class instance.
  p_ctrl = &usbd_vendor.ctrl_table[class_nbr];

  CORE_ENTER_ATOMIC();

  if (usbd_vendor.comm_nbr_next == 0u) {
    CORE_EXIT_ATOMIC();
    return SL_STATUS_ALLOCATION_FAILED;
  }

  // Alloc new vendor class comm info nbr.
  comm_nbr = usbd_vendor.comm_nbr_next - 1u;
  // Next avail vendor class comm info nbr.
  usbd_vendor.comm_nbr_next--;
  CORE_EXIT_ATOMIC();

  // Get vendor class comm info.
  p_comm = &usbd_vendor.comm_tbl[comm_nbr];

  // Config Desc Construction
  // See Note #2.
  // Add vendor IF desc to config desc.
  status = sl_usbd_core_add_interface(config_nbr,
                                      &usbd_vendor_driver,
                                      (void *)p_comm,
                                      NULL,
                                      SL_USBD_CLASS_CODE_VENDOR_SPECIFIC,
                                      SL_USBD_SUBCLASS_CODE_VENDOR_SPECIFIC,
                                      SL_USBD_PROTOCOL_CODE_VENDOR_SPECIFIC,
                                      "Vendor-specific class",
                                      &if_nbr);
  if (status != SL_STATUS_OK) {
    return status;
  }

  // Microsoft ext properties.
#if (USBD_CFG_MS_OS_DESC_EN == 1)
  p_ctrl->interface_number = if_nbr;
#endif

  // Add bulk IN EP desc.
  status = sl_usbd_core_add_bulk_endpoint(config_nbr,
                                          if_nbr,
                                          0u,
                                          true,
                                          0u,
                                          &ep_addr);
  if (status != SL_STATUS_OK) {
    return status;
  }

  // Store bulk IN EP addr.
  p_comm->data_bulk_in_endpoint_address = ep_addr;

  // Add bulk OUT EP desc.
  status = sl_usbd_core_add_bulk_endpoint(config_nbr,
                                          if_nbr,
                                          0u,
                                          false,
                                          0u,
                                          &ep_addr);
  if (status != SL_STATUS_OK) {
    return status;
  }

  // Store bulk OUT EP addr.
  p_comm->data_bulk_out_endpoint_address = ep_addr;

