espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/usb/src/sl_usbd_class_vendor.c
  if (p_ctrl->interrupt_enable == true) {
    if (SL_IS_BIT_CLEAR(config_nbr, SL_USBD_CONFIG_NBR_SPD_BIT) == true) {
      // In FS, bInterval in frames.
      intr_interval = p_ctrl->interrupt_interval;
    } else {
      // In HS, bInterval in microframes.
      intr_interval = p_ctrl->interrupt_interval * 8u;
    }

    // Add intr IN EP desc.
    status = sl_usbd_core_add_interrupt_endpoint(config_nbr,
                                                 if_nbr,
                                                 0u,
                                                 true,
                                                 0u,
                                                 intr_interval,
                                                 &ep_addr);
    if (status != SL_STATUS_OK) {
      return status;
    }

    // Store intr IN EP addr.
    p_comm->interrupt_in_endpoint_address = ep_addr;

    // Add intr OUT EP desc.
    status = sl_usbd_core_add_interrupt_endpoint(config_nbr,
                                                 if_nbr,
                                                 0u,
                                                 false,
                                                 0u,
                                                 intr_interval,
                                                 &ep_addr);
    if (status != SL_STATUS_OK) {
      return status;
    }

    // Store intr OUT EP addr.
    p_comm->interrupt_out_endpoint_address = ep_addr;
  }
  // Store vendor class instance info.
  CORE_ENTER_ATOMIC();
  // Set class instance to init state.
  p_ctrl->state = SLI_USBD_VENDOR_STATE_INIT;
  p_ctrl->class_nbr = class_nbr;
  p_ctrl->comm_ptr = NULL;
  CORE_EXIT_ATOMIC();

  // Save ref to vendor class instance ctrl struct.
  p_comm->ctrl_ptr = p_ctrl;

  return SL_STATUS_OK;
}

/****************************************************************************************************//**
 * Gets the vendor class enable state
 *******************************************************************************************************/
sl_status_t sl_usbd_vendor_is_enabled(uint8_t  class_nbr,
                                      bool     *p_enabled)
{
  sli_usbd_vendor_ctrl_t *p_ctrl;
  sl_usbd_device_state_t  state;
  sl_status_t             status;

  // TODO validate class_nbr
  // Get Vendor class instance ctrl struct.
  p_ctrl = &usbd_vendor.ctrl_table[class_nbr];
  // Get dev state.
  status = sl_usbd_core_get_device_state(&state);

  if ((status == SL_STATUS_OK)
      && (state == SL_USBD_DEVICE_STATE_CONFIGURED)
      && (p_ctrl->state == SLI_USBD_VENDOR_STATE_CONFIG)) {
    *p_enabled = true;
  } else {
    *p_enabled = false;
  }

  return SL_STATUS_OK;
}

/****************************************************************************************************//**
 * Adds a Microsoft OS extended property to this vendor class instance
 *******************************************************************************************************/
#if (USBD_CFG_MS_OS_DESC_EN == 1)
sl_status_t sl_usbd_vendor_add_microsoft_ext_property(uint8_t        class_nbr,
                                                      uint8_t        property_type,
                                                      const uint8_t  *p_property_name,
                                                      uint16_t       property_name_len,
                                                      const uint8_t  *p_property,
                                                      uint32_t       property_len)
{
  uint8_t              ext_property_nbr;
  sli_usbd_vendor_ctrl_t        *p_ctrl;
  sl_usbd_microsoft_ext_property_t *p_ext_property;
  CORE_DECLARE_IRQ_STATE;

  if (class_nbr >= SL_USBD_VENDOR_CLASS_INSTANCE_QUANTITY) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  if (!((property_type == SL_USBD_MICROSOFT_PROPERTY_TYPE_REG_SZ)
        || (property_type == SL_USBD_MICROSOFT_PROPERTY_TYPE_REG_EXPAND_SZ)
        || (property_type == SL_USBD_MICROSOFT_PROPERTY_TYPE_REG_BINARY)
        || (property_type == SL_USBD_MICROSOFT_PROPERTY_TYPE_REG_DWORD_LITTLE_ENDIAN)
        || (property_type == SL_USBD_MICROSOFT_PROPERTY_TYPE_REG_DWORD_BIG_ENDIAN)
        || (property_type == SL_USBD_MICROSOFT_PROPERTY_TYPE_REG_LINK)
        || (property_type == SL_USBD_MICROSOFT_PROPERTY_TYPE_REG_MULTI_SZ))) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  if ((p_property_name == NULL) && (property_name_len != 0u)) {
    return SL_STATUS_NULL_POINTER;
  }

  if ((p_property == NULL) && (property_len != 0u)) {
    return SL_STATUS_NULL_POINTER;
  }

  // Get Vendor class instance ctrl struct.
  p_ctrl = &usbd_vendor.ctrl_table[class_nbr];

  CORE_ENTER_ATOMIC();
  ext_property_nbr = p_ctrl->microsoft_ext_property_next;

#if (RTOS_ARG_CHK_EXT_EN == 1)
  if (ext_property_nbr >= SL_USBD_VENDOR_MS_EXTENDED_PROPERTIES_QUANTITY) {
    CORE_EXIT_ATOMIC();

    return SL_STATUS_ALLOCATION_FAILED;
  }
#endif
  p_ctrl->microsoft_ext_property_next++;

  p_ext_property = &p_ctrl->microsoft_ext_property_table[ext_property_nbr];

  p_ext_property->property_type = property_type;
  p_ext_property->property_name_ptr = p_property_name;
  p_ext_property->property_name_len = property_name_len;
  p_ext_property->property_ptr = p_property;
  p_ext_property->property_len = property_len;
  CORE_EXIT_ATOMIC();

  return SL_STATUS_OK;
}
#endif

/****************************************************************************************************//**
 * Receive the data from the host through the Bulk OUT endpoint
 *******************************************************************************************************/
sl_status_t sl_usbd_vendor_read_bulk_sync(uint8_t    class_nbr,
                                          void       *p_buf,
                                          uint32_t   buf_len,
                                          uint16_t   timeout,
                                          uint32_t   *p_xfer_len)
{
  sli_usbd_vendor_ctrl_t *p_ctrl;
  uint32_t       xfer_len;
  bool      conn;
  sl_status_t        status;

  if (p_xfer_len == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  if ((p_buf == NULL) && (buf_len != 0u)) {
    *p_xfer_len = 0;
    return SL_STATUS_NULL_POINTER;
  }

