espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/usb/src/sl_usbd_class_vendor.c
  if (class_nbr >= SL_USBD_VENDOR_CLASS_INSTANCE_QUANTITY) {
    *p_xfer_len = 0;
    return SL_STATUS_INVALID_PARAMETER;
  }

  sl_usbd_vendor_is_enabled(class_nbr, &conn);

  // Chk class state.
  if (conn != true) {
    *p_xfer_len = 0;
    return SL_STATUS_INVALID_STATE;
  }

  // Get Vendor class instance ctrl struct.
  p_ctrl = &usbd_vendor.ctrl_table[class_nbr];

  status = sl_usbd_core_read_bulk_sync(p_ctrl->comm_ptr->data_bulk_out_endpoint_address,
                                       p_buf,
                                       buf_len,
                                       timeout,
                                       &xfer_len);

  if (status != SL_STATUS_OK) {
    *p_xfer_len = 0;
    return status;
  }

  *p_xfer_len = xfer_len;
  return SL_STATUS_OK;
}

/****************************************************************************************************//**
 * Sends the data to host through Bulk IN endpoint
 *******************************************************************************************************/
sl_status_t sl_usbd_vendor_write_bulk_sync(uint8_t     class_nbr,
                                           void        *p_buf,
                                           uint32_t    buf_len,
                                           uint16_t    timeout,
                                           bool        end,
                                           uint32_t    *p_xfer_len)
{
  sli_usbd_vendor_ctrl_t *p_ctrl;
  uint32_t               xfer_len;
  bool                   conn;
  sl_status_t            status;

  if (p_xfer_len == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  if ((p_buf == NULL) && (buf_len != 0u)) {
    *p_xfer_len = 0;
    return SL_STATUS_NULL_POINTER;
  }

  if (class_nbr >= SL_USBD_VENDOR_CLASS_INSTANCE_QUANTITY) {
    *p_xfer_len = 0;
    return SL_STATUS_INVALID_PARAMETER;
  }

  sl_usbd_vendor_is_enabled(class_nbr, &conn);

  // Chk class state.
  if (conn != true) {
    *p_xfer_len = 0;
    return SL_STATUS_INVALID_STATE;
  }

  // Get Vendor class instance ctrl struct.
  p_ctrl = &usbd_vendor.ctrl_table[class_nbr];

  status = sl_usbd_core_write_bulk_sync(p_ctrl->comm_ptr->data_bulk_in_endpoint_address,
                                        p_buf,
                                        buf_len,
                                        timeout,
                                        end,
                                        &xfer_len);

  if (status != SL_STATUS_OK) {
    *p_xfer_len = 0;
    return status;
  }

  *p_xfer_len = xfer_len;
  return SL_STATUS_OK;
}

/****************************************************************************************************//**
 * Receive the data from the host through the Bulk OUT endpoint
 *******************************************************************************************************/
sl_status_t sl_usbd_vendor_read_bulk_async(uint8_t                         class_nbr,
                                           void                            *p_buf,
                                           uint32_t                        buf_len,
                                           sl_usbd_vendor_async_function_t async_fnct,
                                           void                            *p_async_arg)
{
  sli_usbd_vendor_ctrl_t *p_ctrl;
  bool      conn;
  sl_status_t        status;

  if ((p_buf == NULL) && (buf_len != 0u)) {
    return SL_STATUS_NULL_POINTER;
  }

  if (class_nbr >= SL_USBD_VENDOR_CLASS_INSTANCE_QUANTITY) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  sl_usbd_vendor_is_enabled(class_nbr, &conn);

  // Chk class state.
  if (conn != true) {
    return SL_STATUS_INVALID_STATE;
  }

  // Get Vendor class instance ctrl struct.
  p_ctrl = &usbd_vendor.ctrl_table[class_nbr];

  p_ctrl->bulk_read_async_function = async_fnct;
  p_ctrl->bulk_read_async_arg_ptr = p_async_arg;

  // Check if another xfer is already in progress.
  if (p_ctrl->comm_ptr->data_bulk_out_active_transfer == false) {
    // Indicate that a xfer is in progress.
    p_ctrl->comm_ptr->data_bulk_out_active_transfer = true;
    status = sl_usbd_core_read_bulk_async(p_ctrl->comm_ptr->data_bulk_out_endpoint_address,
                                          p_buf,
                                          buf_len,
                                          usbd_vendor_read_bulk_async_complete,
                                          (void *)p_ctrl);
    if (status != SL_STATUS_OK) {
      p_ctrl->comm_ptr->data_bulk_out_active_transfer = false;
    }
  } else {
    status = SL_STATUS_NOT_READY;
  }

  return status;
}

/****************************************************************************************************//**
 * Sends the data to host through the Bulk IN endpoint
 *******************************************************************************************************/
sl_status_t sl_usbd_vendor_write_bulk_async(uint8_t                         class_nbr,
                                            void                            *p_buf,
                                            uint32_t                        buf_len,
                                            sl_usbd_vendor_async_function_t async_fnct,
                                            void                            *p_async_arg,
                                            bool                            end)
{
  sli_usbd_vendor_ctrl_t  *p_ctrl;
  bool                    conn;
  sl_status_t             status;

  if ((p_buf == NULL) && (buf_len != 0u)) {
    return SL_STATUS_NULL_POINTER;
  }

  if (class_nbr >= SL_USBD_VENDOR_CLASS_INSTANCE_QUANTITY) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  sl_usbd_vendor_is_enabled(class_nbr, &conn);

  // Chk class state.
  if (conn != true) {
    return SL_STATUS_INVALID_STATE;
  }

  // Get Vendor class instance ctrl struct.
  p_ctrl = &usbd_vendor.ctrl_table[class_nbr];

  p_ctrl->bulk_write_async_function = async_fnct;
  p_ctrl->bulk_write_async_arg_ptr = p_async_arg;

  // Check if another xfer is already in progress.
  if (p_ctrl->comm_ptr->data_bulk_in_active_transfer == false) {
    // Indicate that a xfer is in progress.
    p_ctrl->comm_ptr->data_bulk_in_active_transfer = true;
    status = sl_usbd_core_write_bulk_async(p_ctrl->comm_ptr->data_bulk_in_endpoint_address,
                                           p_buf,
                                           buf_len,
                                           usbd_vendor_write_bulk_async_complete,
                                           (void *)p_ctrl,
                                           end);
    if (status != SL_STATUS_OK) {
      p_ctrl->comm_ptr->data_bulk_in_active_transfer = false;
    }
  } else {
    status = SL_STATUS_NOT_READY;
  }

