espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/usb/src/sl_usbd_class_vendor.c
  if (class_nbr >= SL_USBD_VENDOR_CLASS_INSTANCE_QUANTITY) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  sl_usbd_vendor_is_enabled(class_nbr, &conn);

  // Chk class state.
  if (conn != true) {
    return SL_STATUS_INVALID_STATE;
  }

  // Get Vendor class instance ctrl struct.
  p_ctrl = &usbd_vendor.ctrl_table[class_nbr];

  p_ctrl->interrupt_write_async_function = async_fnct;
  p_ctrl->interrupt_write_async_arg_ptr = p_async_arg;

  // Check if another xfer is already in progress.
  if (p_ctrl->comm_ptr->interrupt_in_active_transfer == false) {
    // Indicate that a xfer is in progress.
    p_ctrl->comm_ptr->interrupt_in_active_transfer = true;
    status = sl_usbd_core_write_interrupt_async(p_ctrl->comm_ptr->interrupt_in_endpoint_address,
                                                p_buf,
                                                buf_len,
                                                usbd_vendor_write_interrupt_async_complete,
                                                (void *)p_ctrl,
                                                end);
    if (status != SL_STATUS_OK) {
      p_ctrl->comm_ptr->interrupt_in_active_transfer = false;
    }
  } else {
    status = SL_STATUS_NOT_READY;
  }

  return status;
}

/********************************************************************************************************
 ********************************************************************************************************
 *                                           LOCAL FUNCTIONS
 ********************************************************************************************************
 *******************************************************************************************************/

/****************************************************************************************************//**
 *                                          usbd_vendor_enable()
 *
 * @brief    Notify class that configuration is active.
 *
 * @param    config_nbr      Configuration index to add the interface to.
 *
 * @param    p_if_class_arg  Pointer to class argument.
 *******************************************************************************************************/
static void usbd_vendor_enable(uint8_t config_nbr,
                               void    *p_if_class_arg)
{
  sli_usbd_vendor_comm_t *p_comm;
  sli_usbd_vendor_ctrl_t *p_ctrl;
  CORE_DECLARE_IRQ_STATE;

  (void)&config_nbr;

  p_comm = (sli_usbd_vendor_comm_t *)p_if_class_arg;
  p_ctrl = p_comm->ctrl_ptr;

  CORE_ENTER_ATOMIC();
  p_ctrl->comm_ptr = p_comm;
  p_ctrl->state = SLI_USBD_VENDOR_STATE_CONFIG;
  CORE_EXIT_ATOMIC();

  if (p_ctrl->callback_ptr != NULL && p_ctrl->callback_ptr->enable != NULL) {
    p_ctrl->callback_ptr->enable(p_ctrl->class_nbr);
  }
}

/****************************************************************************************************//**
 *                                          usbd_vendor_disable()
 *
 * @brief    Notify class that configuration is not active.
 *
 * @param    config_nbr      Configuration index to add the interface.
 *
 * @param    p_if_class_arg  Pointer to class argument.
 *******************************************************************************************************/
static void usbd_vendor_disable(uint8_t config_nbr,
                                void    *p_if_class_arg)
{
  sli_usbd_vendor_comm_t *p_comm;
  sli_usbd_vendor_ctrl_t *p_ctrl;
  CORE_DECLARE_IRQ_STATE;

  (void)&config_nbr;

  p_comm = (sli_usbd_vendor_comm_t *)p_if_class_arg;
  p_ctrl = p_comm->ctrl_ptr;

  CORE_ENTER_ATOMIC();
  p_comm->ctrl_ptr->state = SLI_USBD_VENDOR_STATE_INIT;
  CORE_EXIT_ATOMIC();

  if (p_ctrl->callback_ptr != NULL && p_ctrl->callback_ptr->disable != NULL) {
    p_ctrl->callback_ptr->disable(p_ctrl->class_nbr);
  }
}

/****************************************************************************************************//**
 *                                           usbd_vendor_request_handler()
 *
 * @brief    Process vendor-specific request.
 *
 * @param    p_setup_req     Pointer to setup request structure.
 *
 * @param    p_if_class_arg  Pointer to class argument passed to sl_usbd_core_add_interface().
 *
 * @return   true,   if vendor-specific request successfully processed.
 *
 *           false, otherwise.
 *******************************************************************************************************/
static bool usbd_vendor_request_handler(const sl_usbd_setup_req_t *p_setup_req,
                                        void                      *p_if_class_arg)
{
  sli_usbd_vendor_comm_t *p_comm;
  sli_usbd_vendor_ctrl_t *p_ctrl;
  bool                    valid;

  p_comm = (sli_usbd_vendor_comm_t *)p_if_class_arg;
  p_ctrl = p_comm->ctrl_ptr;

  if (p_ctrl->callback_ptr != NULL && p_ctrl->callback_ptr->setup_req != NULL) {
    p_ctrl->callback_ptr->setup_req(p_ctrl->class_nbr, p_setup_req);
    valid = true;
  } else {
    valid = false;
  }

  return (valid);
}

/****************************************************************************************************//**
 *                                       usbd_vendor_get_microsoft_compat_id()
 *
 * @brief    Returns Microsoft descriptor compatible id.
 *
 * @param    p_sub_compat_id_ix  Pointer to the variable that will receive subcompatible id.
 *
 * @return   Compatible id.
 *
 *           false, otherwise.
 *******************************************************************************************************/
#if (USBD_CFG_MS_OS_DESC_EN == 1)
static uint8_t usbd_vendor_get_microsoft_compat_id(uint8_t *p_sub_compat_id_ix)
{
  *p_sub_compat_id_ix = SL_USBD_MICROSOFT_SUBCOMPAT_ID_NULL;

  return (SL_USBD_MICROSOFT_COMPAT_ID_WINUSB);
}
#endif

/****************************************************************************************************//**
 *                                   usbd_vendor_get_microsoft_ext_property_table()
 *
 * @brief    Returns Microsoft descriptor extended properties table.
 *
 * @param    pp_ext_property_tbl     Pointer to the variable that will receive the Microsoft extended
 *                                   properties table.
 *
 * @param    interface_number        Interface number
 *
 * @return   Number of Microsoft extended properties in table.
 *******************************************************************************************************/
#if (USBD_CFG_MS_OS_DESC_EN == 1)
static uint8_t usbd_vendor_get_microsoft_ext_property_table(sl_usbd_microsoft_ext_property_t **pp_ext_property_tbl,
                                                            uint8_t                          interface_number)
{
  sli_usbd_vendor_ctrl_t *p_ctrl;

