espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/usb/src/sl_usbd_class_vendor.c
  for (int i = 0; i < SL_USBD_VENDOR_CLASS_INSTANCE_QUANTITY; i++) {
    // Get Vendor class instance ctrl struct.
    p_ctrl = &usbd_vendor.ctrl_table[i];
    if (p_ctrl->interface_number == interface_number) {
      *pp_ext_property_tbl = p_ctrl->microsoft_ext_property_table;
      // Only one extended property (GUID) supported.
      return (p_ctrl->microsoft_ext_property_next);
    }
  }
  // no extended properties table has been set
  return 0;
}
#endif

/****************************************************************************************************//**
 *                                           usbd_vendor_read_bulk_async_complete()
 *
 * @brief    Inform the application about the Bulk OUT transfer completion.
 *
 * @param    ep_addr     Endpoint address.
 *
 * @param    p_buf       Pointer to the receive buffer.
 *
 * @param    buf_len     Receive buffer length.
 *
 * @param    xfer_len    Number of octets received.
 *
 * @param    p_arg       Additional argument provided by application.
 *
 * @param    status      Transfer status: success or error.
 *******************************************************************************************************/
static void usbd_vendor_read_bulk_async_complete(uint8_t      ep_addr,
                                                 void         *p_buf,
                                                 uint32_t     buf_len,
                                                 uint32_t     xfer_len,
                                                 void         *p_arg,
                                                 sl_status_t  status)
{
  sli_usbd_vendor_ctrl_t *p_ctrl;
  void             *p_callback_arg;

  (void)&ep_addr;

  // Get Vendor class instance ctrl struct.
  p_ctrl = (sli_usbd_vendor_ctrl_t *)p_arg;
  p_callback_arg = p_ctrl->bulk_read_async_arg_ptr;

  // Xfer finished, no more active xfer.
  p_ctrl->comm_ptr->data_bulk_out_active_transfer = false;
  // Call app callback to inform about xfer completion.
  p_ctrl->bulk_read_async_function(p_ctrl->class_nbr,
                                   p_buf,
                                   buf_len,
                                   xfer_len,
                                   p_callback_arg,
                                   status);
}

/****************************************************************************************************//**
 *                                           usbd_vendor_write_bulk_async_complete()
 *
 * @brief    Inform the application about the Bulk IN transfer completion.
 *
 * @param    ep_addr     Endpoint address.
 *
 * @param    p_buf       Pointer to the transmit buffer.
 *
 * @param    buf_len     Transmit buffer length.
 *
 * @param    xfer_len    Number of octets sent.
 *
 * @param    p_arg       Additional argument provided by application.
 *
 * @param    status      Transfer status: success or error.
 *******************************************************************************************************/
static void usbd_vendor_write_bulk_async_complete(uint8_t       ep_addr,
                                                  void          *p_buf,
                                                  uint32_t      buf_len,
                                                  uint32_t      xfer_len,
                                                  void          *p_arg,
                                                  sl_status_t   status)
{
  sli_usbd_vendor_ctrl_t *p_ctrl;
  void             *p_callback_arg;

  (void)&ep_addr;

  // Get Vendor class instance ctrl struct.
  p_ctrl = (sli_usbd_vendor_ctrl_t *)p_arg;
  p_callback_arg = p_ctrl->bulk_write_async_arg_ptr;

  // Xfer finished, no more active xfer.
  p_ctrl->comm_ptr->data_bulk_in_active_transfer = false;
  // Call app callback to inform about xfer completion.
  p_ctrl->bulk_write_async_function(p_ctrl->class_nbr,
                                    p_buf,
                                    buf_len,
                                    xfer_len,
                                    p_callback_arg,
                                    status);
}

/****************************************************************************************************//**
 *                                       usbd_vendor_read_interrupt_async_complete()
 *
 * @brief    Inform the application about the Interrupt OUT transfer completion.
 *
 * @param    ep_addr     Endpoint address.
 *
 * @param    p_buf       Pointer to the receive buffer.
 *
 * @param    buf_len     Receive buffer length.
 *
 * @param    xfer_len    Number of octets received.
 *
 * @param    p_arg       Additional argument provided by application.
 *
 * @param    status      Transfer status: success or error.
 *******************************************************************************************************/
static void usbd_vendor_read_interrupt_async_complete(uint8_t       ep_addr,
                                                      void          *p_buf,
                                                      uint32_t      buf_len,
                                                      uint32_t      xfer_len,
                                                      void          *p_arg,
                                                      sl_status_t   status)
{
  sli_usbd_vendor_ctrl_t *p_ctrl;
  void             *p_callback_arg;

  (void)&ep_addr;

  // Get Vendor class instance ctrl struct.
  p_ctrl = (sli_usbd_vendor_ctrl_t *)p_arg;
  p_callback_arg = p_ctrl->interrupt_read_async_arg_ptr;

  // Xfer finished, no more active xfer.
  p_ctrl->comm_ptr->interrupt_out_active_transfer = false;
  // Call app callback to inform about xfer completion.
  p_ctrl->interrupt_read_async_function(p_ctrl->class_nbr,
                                        p_buf,
                                        buf_len,
                                        xfer_len,
                                        p_callback_arg,
                                        status);
}

/****************************************************************************************************//**
 *                                       usbd_vendor_write_interrupt_async_complete()
 *
 * @brief    Inform the application about the Interrupt IN transfer completion.
 *
 * @param    ep_addr     Endpoint address.
 *
 * @param    p_buf       Pointer to the transmit buffer.
 *
 * @param    buf_len     Transmit buffer length.
 *
 * @param    xfer_len    Number of octets sent.
 *
 * @param    p_arg       Additional argument provided by application.
 *
 * @param    status      Transfer status: success or error.
 *******************************************************************************************************/
static void usbd_vendor_write_interrupt_async_complete(uint8_t      ep_addr,
                                                       void         *p_buf,
                                                       uint32_t     buf_len,
                                                       uint32_t     xfer_len,
                                                       void         *p_arg,
                                                       sl_status_t  status)
{
  sli_usbd_vendor_ctrl_t *p_ctrl;
  void             *p_callback_arg;

  (void)&ep_addr;

  // Get Vendor class instance ctrl struct.
  p_ctrl = (sli_usbd_vendor_ctrl_t *)p_arg;
  p_callback_arg = p_ctrl->interrupt_write_async_arg_ptr;

  // Xfer finished, no more active xfer.
  p_ctrl->comm_ptr->interrupt_in_active_transfer = false;
  // Call app callback to inform about xfer completion.
  p_ctrl->interrupt_write_async_function(p_ctrl->class_nbr,
                                         p_buf,
                                         buf_len,
                                         xfer_len,
                                         p_callback_arg,
                                         status);
}
